In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel(r"D:\NTI\final_project\E_commerce.xlsx", sheet_name = "Customers",header=4)
df

,Unnamed: 0,Customer_Id,First_Name,Last_Name,Email,Phone,Address,City,Country,Registration_Date
0,NaN,C001,Ali,??,user1@mail.com,+20112345,1 Main St,123City,NaN,2024-01-15
1,NaN,C002,??,NaN,user2@mail.com,+20212345,2 Main St,Paris,Japan,2024-05-12
2,NaN,C003,,??,user3@mail.com,+20312345,3 Main St,NYC,??,2024-02-28
3,NaN,C004,Omar,??,user4@mail.com,+20412345,4 Main St,NYC,France,2024-01-15
4,NaN,C005,Sara,Moh#med,user5@mail.com,+20512345,5 Main St,NYC,France,NaN
...,...,...,...,...,...,...,...,...,...,...
95,NaN,C096,,,@mail.com,+209612345,96 Main St,@@Town,Egypt,2024-05-12
96,NaN,C097,NaN,Liu,user97@mail.com,+209712345,97 Main St,NYC,NaN,2024-02-28
97,NaN,C098,NaN,Sara,user98@mail.com,NaN,98 Main St,@@Town,??,2024-05-12
98,NaN,C099,Sara,John,user99@mail.com,+209912345,99 Main St,London,UK,15-01-2025
99,NaN,C100,Liu,Moh#med,user100@mail.com,+2010012345,POBox###,London,USA,2024/12/05

## understand the data

In [4]:
df.shape

(100, 10)

In [5]:
df.head()

,Unnamed: 0,Customer_Id,First_Name,Last_Name,Email,Phone,Address,City,Country,Registration_Date
0,NaN,C001,Ali,??,user1@mail.com,+20112345,1 Main St,123City,NaN,2024-01-15
1,NaN,C002,??,NaN,user2@mail.com,+20212345,2 Main St,Paris,Japan,2024-05-12
2,NaN,C003,,??,user3@mail.com,+20312345,3 Main St,NYC,??,2024-02-28
3,NaN,C004,Omar,??,user4@mail.com,+20412345,4 Main St,NYC,France,2024-01-15
4,NaN,C005,Sara,Moh#med,user5@mail.com,+20512345,5 Main St,NYC,France,NaN

In [6]:
df.drop('Unnamed: 0',axis=1,inplace=True)

In [7]:
df.head()

,Customer_Id,First_Name,Last_Name,Email,Phone,Address,City,Country,Registration_Date
0,C001,Ali,??,user1@mail.com,+20112345,1 Main St,123City,NaN,2024-01-15
1,C002,??,NaN,user2@mail.com,+20212345,2 Main St,Paris,Japan,2024-05-12
2,C003,,??,user3@mail.com,+20312345,3 Main St,NYC,??,2024-02-28
3,C004,Omar,??,user4@mail.com,+20412345,4 Main St,NYC,France,2024-01-15
4,C005,Sara,Moh#med,user5@mail.com,+20512345,5 Main St,NYC,France,NaN

In [8]:
df.drop(columns = ['Email','Phone','Address','City'],axis=1,inplace=True)

In [9]:
df.head()

  Customer_Id First_Name Last_Name Country Registration_Date
0        C001        Ali        ??     NaN        2024-01-15
1        C002         ??       NaN   Japan        2024-05-12
2        C003                   ??      ??        2024-02-28
3        C004       Omar        ??  France        2024-01-15
4        C005       Sara   Moh#med  France               NaN

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Customer_Id        96 non-null     object
 1   First_Name         94 non-null     object
 2   Last_Name          86 non-null     object
 3   Country            80 non-null     object
 4   Registration_Date  94 non-null     object
dtypes: object(5)
memory usage: 4.0+ KB

## Data Prepocessing

In [12]:
# checking nulls
df.isna().sum()

Customer_Id           4
First_Name            6
Last_Name            14
Country              20
Registration_Date     6
dtype: int64

In [13]:
df[df['First_Name'].isnull() == 1]

   Customer_Id First_Name Last_Name Country Registration_Date
11        C012        NaN             Japan        2025/15/01
16        C017        NaN       Liu     NaN        not_a_date
48        C049        NaN      Jane   Egypt        15-01-2025
86        C087        NaN       NaN     NaN        2024-01-15
96        C097        NaN       Liu     NaN        2024-02-28
97        C098        NaN      Sara      ??        2024-05-12

In [14]:
df['First_Name'].value_counts()

First_Name
Liu        15
Ali        12
Lea        10
Anna@      10
Jane        9
Moh#med     8
??          7
            7
John        7
Sara        5
Omar        4
Name: count, dtype: int64

In [15]:
df['First_Name'].value_counts()

First_Name
Liu        15
Ali        12
Lea        10
Anna@      10
Jane        9
Moh#med     8
??          7
            7
John        7
Sara        5
Omar        4
Name: count, dtype: int64

In [16]:
df['First_Name'].fillna('Unknown', inplace=True)

C:\Users\7520\AppData\Local\Temp\ipykernel_820\4062191418.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['First_Name'].fillna('Unknown', inplace=True)

In [17]:
df['First_Name'].value_counts()

First_Name
Liu        15
Ali        12
Lea        10
Anna@      10
Jane        9
Moh#med     8
??          7
            7
John        7
Unknown     6
Sara        5
Omar        4
Name: count, dtype: int64

In [18]:
df['First_Name'] = df['First_Name'].str.replace(' ','Unknown',regex=True)

In [19]:
df['First_Name'].value_counts()

First_Name
Liu        15
Unknown    13
Ali        12
Lea        10
Anna@      10
Jane        9
Moh#med     8
??          7
John        7
Sara        5
Omar        4
Name: count, dtype: int64

In [20]:
df['First_Name'] = df['First_Name'].str.replace('#','a',regex=True)

In [21]:
df['First_Name'] = df['First_Name'].str.replace('@',' ',regex=True)

In [22]:
df['First_Name'] = df['First_Name'].str.replace(r'[^a-zA-Z\s]', 'Unknown', regex=True)

In [23]:
df['First_Name'].value_counts()

First_Name
Liu               15
Unknown           13
Ali               12
Lea               10
Anna              10
Jane               9
Mohamed            8
UnknownUnknown     7
John               7
Sara               5
Omar               4
Name: count, dtype: int64

In [24]:
df['First_Name']= df['First_Name'].str.replace('UnknownUnknown','Unknown',regex=True)

In [25]:
df['First_Name'].value_counts()

First_Name
Unknown    20
Liu        15
Ali        12
Lea        10
Anna       10
Jane        9
Mohamed     8
John        7
Sara        5
Omar        4
Name: count, dtype: int64

In [26]:
df['Last_Name'].value_counts()

Last_Name
Moh#med    12
           11
Lea        10
Jane        9
??          8
Sara        8
Anna@       7
Liu         6
Omar        5
Ali         5
John        5
Name: count, dtype: int64

In [27]:
df['Last_Name'] = df['Last_Name'].str.replace('#','a',regex=True)
df['Last_Name'] = df['Last_Name'].str.replace('@',' ',regex=True)

In [28]:
df['Last_Name'].value_counts()

Last_Name
Mohamed    12
           11
Lea        10
Jane        9
??          8
Sara        8
Anna        7
Liu         6
Omar        5
Ali         5
John        5
Name: count, dtype: int64

In [29]:
df['Last_Name'] = df['Last_Name'].str.strip().replace(['', '??'], 'Unknown')
df['Last_Name'] = df['Last_Name'].fillna('Unknown')

In [30]:
df

   Customer_Id First_Name Last_Name Country Registration_Date
0         C001        Ali   Unknown     NaN        2024-01-15
1         C002    Unknown   Unknown   Japan        2024-05-12
2         C003    Unknown   Unknown      ??        2024-02-28
3         C004       Omar   Unknown  France        2024-01-15
4         C005       Sara   Mohamed  France               NaN
..         ...        ...       ...     ...               ...
95        C096    Unknown   Unknown   Egypt        2024-05-12
96        C097    Unknown       Liu     NaN        2024-02-28
97        C098    Unknown      Sara      ??        2024-05-12
98        C099       Sara      John      UK        15-01-2025
99        C100        Liu   Mohamed     USA        2024/12/05

[100 rows x 5 columns]

In [31]:
df['Country'].value_counts()

Country
France    16
Japan     15
??        13
UK        13
Egypt     13
USA       10
Name: count, dtype: int64

In [32]:
df['Country'] = df['Country'].str.replace(r'[^a-zA-Z\s]', 'Unknown', regex=True)

In [33]:
df['Country'] = df['Country'].str.replace('UnknownUnknown','Unknown',regex=True)

In [34]:
df['Country'] = df['Country'].str.replace('UK','United Kingdom',regex=True)

In [35]:
df['Country'] = df['Country'].str.replace('USA','United States',regex=True)

In [36]:
df['Country']=df['Country'].fillna('Unknown')

In [37]:
df['Country'].value_counts()

Country
Unknown           33
France            16
Japan             15
United Kingdom    13
Egypt             13
United States     10
Name: count, dtype: int64

In [38]:
df['Registration_Date'].value_counts()

Registration_Date
2024-02-28    14
not_a_date    13
2024-05-12    12
2024/12/05    12
15-01-2025    12
2025/15/01     9
2024-01-15     8
32-13-2025     8
2024-07-21     6
Name: count, dtype: int64

In [40]:
df["Registration_Date"] = pd.to_datetime(df["Registration_Date"], errors="coerce", dayfirst=True)
df["Registration_Date"] = df["Registration_Date"].dt.strftime("%m/%d/%Y")

C:\Users\7520\AppData\Local\Temp\ipykernel_820\1097839120.py:1: UserWarning: Parsing dates in %Y-%m-%d format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  df["Registration_Date"] = pd.to_datetime(df["Registration_Date"], errors="coerce", dayfirst=True)

In [42]:
df['Registration_Date'].value_counts()

Registration_Date
02/28/2024    14
05/12/2024    12
01/15/2024     8
07/21/2024     6
Name: count, dtype: int64

In [44]:
df

   Customer_Id First_Name Last_Name         Country Registration_Date
0         C001        Ali   Unknown         Unknown        01/15/2024
1         C002    Unknown   Unknown           Japan        05/12/2024
2         C003    Unknown   Unknown         Unknown        02/28/2024
3         C004       Omar   Unknown          France        01/15/2024
4         C005       Sara   Mohamed          France               NaN
..         ...        ...       ...             ...               ...
95        C096    Unknown   Unknown           Egypt        05/12/2024
96        C097    Unknown       Liu         Unknown        02/28/2024
97        C098    Unknown      Sara         Unknown        05/12/2024
98        C099       Sara      John  United Kingdom               NaN
99        C100        Liu   Mohamed   United States               NaN

[100 rows x 5 columns]

In [46]:
df["Registration_Date"] = df["Registration_Date"].fillna("2024/02/28")

In [48]:
df

   Customer_Id First_Name Last_Name         Country Registration_Date
0         C001        Ali   Unknown         Unknown        01/15/2024
1         C002    Unknown   Unknown           Japan        05/12/2024
2         C003    Unknown   Unknown         Unknown        02/28/2024
3         C004       Omar   Unknown          France        01/15/2024
4         C005       Sara   Mohamed          France        2024/02/28
..         ...        ...       ...             ...               ...
95        C096    Unknown   Unknown           Egypt        05/12/2024
96        C097    Unknown       Liu         Unknown        02/28/2024
97        C098    Unknown      Sara         Unknown        05/12/2024
98        C099       Sara      John  United Kingdom        2024/02/28
99        C100        Liu   Mohamed   United States        2024/02/28

[100 rows x 5 columns]

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Customer_Id        96 non-null     object
 1   First_Name         100 non-null    object
 2   Last_Name          100 non-null    object
 3   Country            100 non-null    object
 4   Registration_Date  100 non-null    object
dtypes: object(5)
memory usage: 4.0+ KB

In [52]:
df

   Customer_Id First_Name Last_Name         Country Registration_Date
0         C001        Ali   Unknown         Unknown        01/15/2024
1         C002    Unknown   Unknown           Japan        05/12/2024
2         C003    Unknown   Unknown         Unknown        02/28/2024
3         C004       Omar   Unknown          France        01/15/2024
4         C005       Sara   Mohamed          France        2024/02/28
..         ...        ...       ...             ...               ...
95        C096    Unknown   Unknown           Egypt        05/12/2024
96        C097    Unknown       Liu         Unknown        02/28/2024
97        C098    Unknown      Sara         Unknown        05/12/2024
98        C099       Sara      John  United Kingdom        2024/02/28
99        C100        Liu   Mohamed   United States        2024/02/28

[100 rows x 5 columns]

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Customer_Id        96 non-null     object
 1   First_Name         100 non-null    object
 2   Last_Name          100 non-null    object
 3   Country            100 non-null    object
 4   Registration_Date  100 non-null    object
dtypes: object(5)
memory usage: 4.0+ KB

In [56]:
df.to_excel(r'D:\NTI\final_project\clened_commerce.xlsx', index=False)